yii-app/controllers/UserController.php

INSERT INTO `user` (`username`, `password`, `accessToken`) VALUES ('example', 'user1234', 'UkJHsdpO_7yKHU_7pGo2K2Btyx_iEgNZ')
---
    public function actionSignup() {
        Yii::$app->response->format = Response::FORMAT_JSON;
        header('content-type: application/json');
        $model = new User();
        if (Yii::$app->request->isPost) {
            $model->username = Yii::$app->request->post("username");
            $model->password = Yii::$app->request->post("password");
            $model->accessToken = Yii::$app->security->generateRandomString();

            if ($model->validate()) {
                $model->save();