yii-app/models/User.php

SELECT * FROM `user` WHERE `accessToken`='y1X-cSAAgLhNDUCgXc4xrvXawF-pIsTH'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        $result = User::findOne(['accessToken' => $token]);